tap "archivebox/archivebox"
tap "espanso/espanso"
tap "filosottile/musl-cross"
tap "helix-editor/helix"
tap "hettysoft/tap"
tap "homebrew/bundle"
tap "homebrew/cask", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-cask.git"
tap "homebrew/cask-drivers", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-cask-drivers.git"
tap "homebrew/cask-fonts", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-cask-fonts.git"
tap "homebrew/cask-versions", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-cask-versions.git"
tap "homebrew/command-not-found", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-command-not-found.git"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "shivammathur/php"
tap "sunnyyoung/repo"
tap "tako8ki/tap"
tap "wez/wezterm"
tap "xo/xo"
brew "openjdk"
brew "allure"
brew "webp"
brew "coreutils"
brew "asdf"
brew "atuin"
brew "bash"
brew "bat"
brew "bottom"
brew "broot"
brew "python@3.11"
brew "openldap"
brew "curl"
brew "node"
brew "czg"
brew "dog"
brew "dust"
brew "exiftool"
brew "eza"
brew "fd"
brew "fnm"
brew "freetds"
brew "fselect"
brew "fzf"
brew "gcc"
brew "git"
brew "git-branchless"
brew "git-delta"
brew "git-lfs"
brew "gitui"
brew "glow"
brew "unbound"
brew "gnutls"
brew "gnupg"
brew "go"
brew "goaccess"
brew "gping"
brew "guile"
brew "helix"
brew "httpie"
brew "jq"
brew "krb5"
brew "lazygit"
brew "libpq"
brew "lsd"
brew "luajit"
brew "luarocks"
brew "mitmproxy"
brew "monolith"
brew "python-tabulate"
brew "mycli"
brew "mysql-client"
brew "navi"
brew "tree-sitter"
brew "neovim"
brew "nghttp2"
brew "nginx"
brew "nnn"
brew "nushell"
brew "onefetch"
brew "openssl@1.1"
brew "openvpn"
brew "ouch"
brew "pandoc"
brew "poppler"
brew "procs"
brew "python@3.10"
brew "python@3.9"
brew "ripgrep"
brew "ruby"
brew "rustscan"
brew "starship"
brew "tcl-tk"
brew "tealdeer"
brew "thefuck"
brew "tmux"
brew "unar"
brew "unzip"
brew "uutils-coreutils", link: false
brew "vim"
brew "wget"
brew "xplr"
brew "yazi"
brew "zellij"
brew "zoxide"
brew "zsh"
brew "archivebox/archivebox/archivebox"
brew "filosottile/musl-cross/musl-cross"
brew "tako8ki/tap/gobang"
brew "xo/xo/usql"
cask "another-redis-desktop-manager"
cask "anytype"
cask "appflowy"
cask "devtoys"
cask "drawio"
cask "easydict"
cask "emacs"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-lxgw-wenkai"
cask "font-monaspace-nerd-font"
cask "hammerspoon"
cask "hiddenbar"
cask "keycastr"
cask "licecap"
cask "logseq"
cask "miaoyan"
cask "monitorcontrol"
cask "mos"
cask "motrix"
cask "mysqlworkbench"
cask "qutebrowser"
cask "raycast"
cask "squirrel"
cask "wechattweak-cli"
cask "wezterm"
vscode "alefragnani.Bookmarks"
vscode "alefragnani.project-manager"
vscode "antfu.slidev"
vscode "antfu.unocss"
vscode "asvetliakov.vscode-neovim"
vscode "Catppuccin.catppuccin-vsc"
vscode "Catppuccin.catppuccin-vsc-icons"
vscode "cweijan.vscode-office"
vscode "DavidAnson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "DominicVonk.parameter-hints"
vscode "eamodio.gitlens"
vscode "EditorConfig.EditorConfig"
vscode "esbenp.prettier-vscode"
vscode "golang.go"
vscode "hollowtree.vue-snippets"
vscode "humao.rest-client"
vscode "jasonnutter.search-node-modules"
vscode "mirone.milkdown"
vscode "ms-python.black-formatter"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "oderwat.indent-rainbow"
vscode "tamasfe.even-better-toml"
vscode "vincaslt.highlight-matching-tag"
vscode "Vue.volar"
vscode "wayou.vscode-todo-highlight"
vscode "yinfei.luahelper"
vscode "yzhang.markdown-all-in-one"
