tap "anomalyco/tap"
tap "homebrew/bundle"
brew "atuin"
brew "bash"
brew "bat"
brew "bottom"
brew "cloc"
brew "coreutils"
brew "curl"
brew "czg"
brew "dog"
brew "dust"
brew "exiftool"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fnm"
brew "fselect"
brew "fzf"
brew "git"
brew "git-branchless"
brew "git-delta"
brew "git-lfs"
brew "gnu-sed"
brew "gnupg"
brew "gping"
brew "httpie"
brew "jq"
brew "lazygit"
brew "lsd"
brew "luajit"
brew "luarocks"
brew "mole"
brew "mycli"
brew "mysql-client@8.0"
brew "mysql-client@8.4", link: true
brew "tree-sitter"
brew "neovim"
brew "nushell"
brew "oha"
brew "onefetch"
brew "pandoc"
brew "procs"
brew "ripgrep"
brew "rustscan"
brew "starship"
brew "thefuck"
brew "tlrc"
brew "tmux"
brew "tokei"
brew "uv"
brew "wget"
brew "wireguard-tools"
brew "yazi"
brew "zellij"
brew "zoxide"
brew "zsh"
brew "anomalyco/tap/opencode"
cask "another-redis-desktop-manager"
cask "anytype"
cask "chromium"
cask "claude-code"
cask "drawio"
cask "easydict"
cask "flameshot"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-lxgw-wenkai"
cask "font-monaspice-nerd-font"
cask "hammerspoon"
cask "hiddenbar"
cask "iina"
cask "keycastr"
cask "licecap"
cask "localsend"
cask "logseq"
cask "mitmproxy"
cask "mos"
cask "mysqlworkbench"
cask "qutebrowser"
cask "raycast"
cask "squirrel-app"
cask "wezterm"
vscode "alibaba-cloud.tongyi-lingma"
vscode "antfu.iconify"
vscode "antfu.slidev"
vscode "antfu.unocss"
vscode "asvetliakov.vscode-neovim"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "christian-kohler.path-intellisense"
vscode "csstools.postcss"
vscode "cweijan.vscode-office"
vscode "dbaeumer.vscode-eslint"
vscode "dominicvonk.parameter-hints"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "evils.uniapp-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "hollowtree.vue-snippets"
vscode "humao.rest-client"
vscode "jasonnutter.search-node-modules"
vscode "lokalise.i18n-ally"
vscode "mariusalchimavicius.json-to-ts"
vscode "mikestead.dotenv"
vscode "mirone.milkdown"
vscode "ms-python.black-formatter"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "oderwat.indent-rainbow"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "streetsidesoftware.code-spell-checker"
vscode "stylelint.vscode-stylelint"
vscode "sumneko.lua"
vscode "tamasfe.even-better-toml"
vscode "uni-helper.uni-app-schemas-vscode"
vscode "uni-helper.uni-app-snippets-vscode"
vscode "uni-helper.uni-cloud-snippets-vscode"
vscode "uni-helper.uni-helper-vscode"
vscode "uni-helper.uni-highlight-vscode"
vscode "uni-helper.uni-ui-snippets-vscode"
vscode "vincaslt.highlight-matching-tag"
vscode "vue.volar"
vscode "warmthsea.vscode-custom-code-color"
vscode "wayou.vscode-todo-highlight"
vscode "yzhang.markdown-all-in-one"
