tap "archivebox/archivebox"
tap "espanso/espanso"
tap "filosottile/musl-cross"
tap "helix-editor/helix"
tap "hettysoft/tap"
tap "homebrew/bundle"
tap "homebrew/cask", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-cask.git"
tap "homebrew/cask-drivers", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-cask-drivers.git"
tap "homebrew/cask-fonts", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-cask-fonts.git"
tap "homebrew/cask-versions", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-cask-versions.git"
tap "homebrew/command-not-found", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-command-not-found.git"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "shivammathur/php"
tap "sunnyyoung/repo"
tap "tako8ki/tap"
tap "wez/wezterm"
tap "xo/xo"
brew "allure"
brew "webp"
brew "coreutils"
brew "asdf"
brew "atuin"
brew "bash"
brew "bat"
brew "bottom"
brew "curl"
brew "dog"
brew "exa"
brew "fd"
brew "fnm"
brew "fselect"
brew "fzf"
brew "gcc"
brew "git"
brew "git-branchless"
brew "git-delta"
brew "gitui"
brew "unbound"
brew "gnutls"
brew "gnupg"
brew "go"
brew "goaccess"
brew "gping"
brew "guile"
brew "helix"
brew "httpie"
brew "lazygit"
brew "mitmproxy"
brew "monolith"
brew "python-tabulate"
brew "mycli"
brew "mysql-client"
brew "navi"
brew "tree-sitter"
brew "neovim"
brew "nghttp2"
brew "nginx", restart_service: true
brew "nnn"
brew "node"
brew "nushell"
brew "onefetch"
brew "openvpn"
brew "ouch"
brew "procs"
brew "python@3.10"
brew "python@3.9"
brew "ripgrep"
brew "ruby"
brew "rustscan"
brew "starship"
brew "tcl-tk"
brew "tealdeer"
brew "thefuck"
brew "tmux"
brew "tre-command"
brew "unar"
brew "unzip"
brew "vim"
brew "wget"
brew "zellij"
brew "zoxide"
brew "zsh"
brew "archivebox/archivebox/archivebox"
brew "filosottile/musl-cross/musl-cross"
brew "tako8ki/tap/gobang"
brew "xo/xo/usql"
cask "another-redis-desktop-manager"
cask "devtoys"
cask "emacs"
cask "font-fira-code-nerd-font"
cask "font-lxgw-wenkai"
cask "hammerspoon"
cask "hiddenbar"
cask "licecap"
cask "logseq"
cask "mos"
cask "motrix"
cask "mysqlworkbench"
cask "raycast"
cask "squirrel"
cask "wechattweak-cli"
cask "wezterm"
vscode "alefragnani.Bookmarks"
vscode "alefragnani.project-manager"
vscode "antfu.unocss"
vscode "cweijan.vscode-office"
vscode "DavidAnson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "DominicVonk.parameter-hints"
vscode "DotJoshJohnson.xml"
vscode "eamodio.gitlens"
vscode "EditorConfig.EditorConfig"
vscode "Equinusocio.vsc-community-material-theme"
vscode "Equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "foam.foam-vscode"
vscode "formulahendry.code-runner"
vscode "golang.go"
vscode "hediet.vscode-drawio"
vscode "hollowtree.vue-snippets"
vscode "jasonnutter.search-node-modules"
vscode "marp-team.marp-vscode"
vscode "mirone.milkdown"
vscode "oderwat.indent-rainbow"
vscode "PKief.material-icon-theme"
vscode "TabNine.tabnine-vscode"
vscode "tamasfe.even-better-toml"
vscode "vincaslt.highlight-matching-tag"
vscode "vscodevim.vim"
vscode "Vue.volar"
vscode "wayou.vscode-todo-highlight"
vscode "withfig.fig"
vscode "yinfei.luahelper"
vscode "yzhang.markdown-all-in-one"
